sso/app/models/user.rb

  def generate_tok(app_id)
    token = SecureRandom.hex
    t = self.tokens.find_or_initialize_by(app_id: app_id)
---
SELECT  "tokens".* FROM "tokens" WHERE "tokens"."user_id" = ? AND "tokens"."app_id" = ? LIMIT ?  [["user_id", 1], ["app_id", "200"], ["LIMIT", 1]]