sso/app/controllers/sso_controller.rb

  def verify_token
    if params[:token].nil?
      render json: { success: false, message: "Token doesn't exist" }
    else
      token = Token.where(token: params[:token], app_id: params[:app_id]).first
---
SELECT  "tokens".* FROM "tokens" WHERE "tokens"."token" = ? AND "tokens"."app_id" = ? ORDER BY "tokens"."id" ASC LIMIT ?  [["token", "3032ffc9f14e45a46f68cf4fabaa4bc1"], ["app_id", "100"], ["LIMIT", 1]]

  def authenticate
    user = User.find_for_authentication(email: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "santattech@gmail.com"], ["LIMIT", 1]]

  def destroy_token
    token = Token.where(token: params[:token], app_id: params[:app_id]).first
    token.user.tokens.destroy_all
---
SELECT  "tokens".* FROM "tokens" WHERE "tokens"."token" = ? AND "tokens"."app_id" = ? ORDER BY "tokens"."id" ASC LIMIT ?  [["token", "5a7401059186090f73fe5ec8a39fb09b"], ["app_id", "100"], ["LIMIT", 1]]
DELETE FROM "tokens" WHERE "tokens"."id" = ?  [["id", 11]]

  def get_active_token
    user = User.find_by(email: cookies[:cook_sso].presence)
    is_valid_app = user && user.app_ids.split(",").map(&:strip).include?(params[:app_id])

    if user && params[:app_id].present? && is_valid_app && user.tokens.present?
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "santattech@gmail.com"], ["LIMIT", 1]]
SELECT "tokens".* FROM "tokens" WHERE "tokens"."user_id" = ?  [["user_id", 1]]